### Assignment 23 Feb

### Q1

In [1]:
import pandas as pd

In [2]:
pandas_series_data = pd.Series( [4, 8, 15, 16, 23,42])
pandas_series_data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2

In [18]:
data = [1,2,3,4,5,6,7,8,9,10]
type(data)

list

In [16]:
series_data = pd.Series(data)
series_data

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']
}

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['New York', 'London', 'Paris']}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

### Q4

####  DataFrame is a two-dimensional array that have rows and columns. that can contain multiple type of datas and it is an object of python pandas. on the other hand series is an one dimensional array it can also have contain one types multiple data as well.

#### series contain one type of datas where is Dataframe contain multi types of data.  
#### series size immutable where is Dataframe size is mutable. 
#### series data mutable where is Dataframe data also same.

### Example :-

In [11]:
df # Dataframe Data

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [13]:
pandas_series_data ### series Data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q5

#### len() :- is used to find the length of any DF or values etc
#### tail() :- return the bottom 5 rows data from the DF
#### describe() :- return the DF stastical information 
#### isnul() :- to check there is any null value or not 
#### head() :- return the top five datarows from DF
#### apply() :- is used to set custom condition

#### in pandas we have many more predefine function is the and it will be used as per the needed.

### Q6

In [18]:
header =  pd.Series(['name', 'address' , 'product' ])
data1 = pd.Series(['akash' , 'mum' , 'iphone'])
data2 = pd.Series(['ram' , 'del' , 'vivo'])
data3 = pd.Series(['mukesh' , 'ban' , 'oppo'])

In [19]:
 pd.DataFrame([header,data1,data2, data3])

        0        1        2
0    name  address  product
1   akash      mum   iphone
2     ram      del     vivo
3  mukesh      ban     oppo